cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'd12frosted/emacs-plus'
tap 'go-delve/delve'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'neovim/neovim'
tap 'railwaycat/emacsmacport'

brew 'archey'
brew 'aspell'
brew 'atool'
brew 'autoconf'
brew 'automake'
brew 'boost'
brew 'cairo'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'curl'
brew 'delve'
brew 'diff-so-fancy'
brew 'elixir'
brew 'elm'
brew 'emacs-plus'
brew 'erlang'
brew 'ffind'
brew 'findutils'
brew 'fontconfig'
brew 'fpp'
brew 'freetype'
brew 'fswatch'
brew 'gawk'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'git-flow'
brew 'git-open'
brew 'glib'
brew 'gmp'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gradle'
brew 'graphviz'
brew 'grep'
brew 'harfbuzz'
brew 'highlight'
brew 'htop'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'ios-deploy'
brew 'jetty'
brew 'jpeg'
brew 'leiningen'
brew 'libcroco'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libmagic'
brew 'libmemcached'
brew 'libpng'
brew 'librsvg'
brew 'libsodium'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'libyaml'
brew 'lua'
brew 'mackup'
brew 'macvim'
brew 'makedepend'
brew 'maven'
brew 'memcached'
brew 'mercurial'
brew 'mongodb'
brew 'mono'
brew 'mpfr'
brew 'mpg123'
brew 'mysql'
brew 'nettle'
brew 'nvm'
brew 'openssl'
brew 'p7zip'
brew 'pango'
brew 'pcre'
brew 'peco'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'ranger'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby-build'
brew 'sbt'
brew 'scala'
brew 'scons'
brew 'sip'
brew 'sqlite'
brew 'stow'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'tomcat'
brew 'tree'
brew 'uncrustify'
brew 'unixodbc'
brew 'weechat'
brew 'wget'
brew 'wxmac'
brew 'xz'
brew 'zeromq'
brew 'zsh'
brew 'zsh-completions'
brew 'ack'
brew 'grc'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'


# cask '1password'
# cask 'adium'
# cask 'atom'
# cask 'firefox'
# cask 'garmin-express' # gis
# cask 'google-chrome'
# cask 'handbrake' # video convert
# cask 'mapbox-studio'
# cask 'seashore' # image editor
# cask 'slack'
# cask 'steam' # game
# cask 'transmission' # bt downlad
# cask 'tunnelbear' # vpn
# cask 'vlc'
